require('plugins')
require('settings')
require('custom_functions')
require('keymap')

-- TODO выучить https://github.com/BurntSushi/ripgrep/blob/master/GUIDE.md
-- TODO на скроллбаре всякие ништяки гит где менял, переменная на которой я где еще есть
-- TODO бар с гитблеймом
-- TODO вот бы терминал такой же пиздатый как в лунарвиме
-- TODO видеть где я, типа что если в модуль провалился
-- TODO символы посмотреть/полную иерархию вызова
-- TODO линтеры
-- TODO форматеры
-- TODO енкодинг
-- TODO вимдифф
-- TODO откатить до сохраненного состояния
-- TODO гдето в одном месте писать путь к питону а не в проекте + афетплагин/дап
-- TODO по гиту слабо прыгать чтобы смотреть историю изменения какогонибудь кусочка
-- TODO синк кода
-- TODO иконки?)
-- TODO обкатать схему когда у меня появился код я побырику открываю редактор чето редактирую на лету регекспами
-- TODO в сублиме есть тема что грохнул полностью потом открыл и все на месте даже если не сохранил вот бы также
-- TODO иконки для букмарок/квикфикслист для букмарок
-- TODO фолдить вложенность
-- TODO открывать ссылку на гитхабе GBrowse реботает паршивенько - без строчки
-- TODO автопереключение юзыка на инглиш в комманд моде и возвращения в инсерт моде
		-- vim.opt.keymap = "russian-jcukenwin"
		-- vim.opt.iminsert = 0

		-- -- переключаем язык в инсертмоде по Ctrl + l (по-умолчанию Ctrl+^)
		-- lvim.keys.insert_mode["<C-l>"] = "<C-6>"
-- TODO в лунар виме както размутили иконки без нердфонта
-- TODO посмотреть структуру, типа такието классы с методами в этом файле
-- TODO иногда копипащу путь как-то коряво то с точками то со слешами находить
-- TODO копировать путь текущего файла
-- TODO как логи вима смотреть или недавние аутпуты или логи плагинов, что с ним
-- TODO держать фокус в нетрв/квикфикслисте

-- TODO автоимпорты?
-- TODO двигать вправо влево табом
